ckcd1hp/First-Test-ESP32/src/main.cpp
#include <NTPClient.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <ESPAsyncWebServer.h>
#include <SPIFFS.h>
#include <ESP32Time.h>
#include <WebSerial.h>
#include <AsyncElegantOTA.h>

#include "config.h"
#include "pins.h"
#include "waterLevel.h"
#include "dhtReadings.h"

#define UTC_OFFSET_IN_SECONDS -36000 // offset from greenwich time (Hawaii is UTC-10)
#define NTP_SYNC_HOUR 4
#define NTP_SYNC_MINUTE 0
#define NTP_SYNC_SECOND 0
#define WIFI_RETRY_WAIT_TIME 300000 // 5 minutes in milliseconds
#define NTP_UPDATE_INTERVAL 1800000 // 30 min in milliseconds (minimum retry time, normally daily)
#define SOUND_SPEED 0.0343          // cm/microsecond

// function declarations
void WiFiStationConnected(WiFiEvent_t event, WiFiEventInfo_t info);                                  // on connect to Wifi
void WiFiGotIP(WiFiEvent_t event, WiFiEventInfo_t info);                                             // on IP received from Wifi
void WiFiStationDisconnected(WiFiEvent_t event, WiFiEventInfo_t info);                               // on disconnect from Wifi
void updateAndSyncTime();                                                                            // update time from NTP server and sync to RTC
String processor(const String &var);                                                                 // update web page with variables
unsigned long setInterval(void (*callback)(), unsigned long previousMillis, unsigned long interval); // run function at interval

void overridePump(int pump_pin, int state, int time); // put a pump in override
void setPumpAuto(int pump_pin);                       //  set a pump back to auto
void controlPumps(int currentHour, int currentMin);   // control water pumps in auto or override
void checkPumpAlarms();                               // check if pump status doesn't match command
void updatePumpStatuses();                            // update web with pump statuses
void checkOverrideStatuses(int currentSecond);        // check override statuses every second

// Define NTP Client to get time
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", UTC_OFFSET_IN_SECONDS, NTP_UPDATE_INTERVAL);
ESP32Time rtc; // no offset, as that is already added from NTPClient
bool rtcUpdated = false;
String lastNTPSync = "";

// time interval setup
int dhtInterval = 900000;             // check dht every 15 minutes
int updatePumpStatusInterval = 10000; // update pump statuses to web server every 10 seconds
int waterLevelInterval = 60000;       // check water level every minute
int adcSamplingInterval = 50;         // 50 milliseconds means 20 samples in 1 second
unsigned long dhtMillisCounter = 0;
unsigned long wifiPrevMillis = 0;
unsigned long adcSamplingMillisCounter = 0;
unsigned long pumpStatusMillisCounter = 0;
unsigned long waterLevelMillisCounter = 0;
int samplingCounter = 0;
float pump1Samples = 0.0;
float pump2Samples = 0.0;
float airPumpSamples = 0.0;
unsigned long now;
int previousMinute = -1; // track the last minute to run functions on the new minute
int previousSecond = -1; // track the last second to run functions on the new second

// create AsyncWebServer on port 80
AsyncWebServer server(80);
// Create an Event Source on /events
AsyncEventSource events("/events");

String ledState;
bool pump1Command = false;
bool pump1Override = false;
bool pump1Status = false;
unsigned long pump1OverrideTimeEpochEnd = 0; // if pump overriden for 5 min, this will be set to current epoch + 5*60
bool pump2Command = false;
bool pump2Override = false;
bool pump2Status = false;
unsigned long pump2OverrideTimeEpochEnd = 0; // if pump overriden for 5 min, this will be set to current epoch + 5*60
bool airPumpCommand = false;                 // toggle
bool airPumpOverride = false;
bool airPumpStatus = false;
unsigned long airPumpOverrideTimeEpochEnd = 0; // if pump overriden for 5 min, this will be set to current epoch + 5*60
float mvPerAmp = 0.185;                        // sensitivity for ACS712 5A current sensor
bool readyToConnectWifi = true;                // ready to try connecting to wifi
// GET REQUEST PARAMETERS
const char *PARAM_OUTPUT = "output";
const char *PARAM_STATE = "state";
const char *PARAM_TIME = "time";

// only update status once a min on web server when there is an override timer
bool pump1StatusUpdated = false;
bool pump2StatusUpdated = false;
bool airPumpStatusUpdated = false;

// ALARMS
bool pump1Alarm = false;
bool pump2Alarm = false;
bool airPumpAlarm = false;
// alarm after 1 minute of command/status mismatch
unsigned long pump1AlarmTimeEpochEnd = 0;
unsigned long pump2AlarmTimeEpochEnd = 0;
unsigned long airPumpAlarmTimeEpochEnd = 0;
// temps
extern float f, hif, h;

void setup()
{
  Serial.begin(115200);
  Serial.println("Setup begin");
  // set pinout
  pinMode(LED_PIN, OUTPUT);
  pinMode(WATER_PUMP_1_PIN, OUTPUT);
  pinMode(WATER_PUMP_2_PIN, OUTPUT);
  pinMode(AIR_PUMP_PIN, OUTPUT);
  // water pump current pins are input only (34 and 35) and don't need to be set
  pinMode(AIR_PUMP_CURRENT, INPUT);
  dht.begin();
  ultrasonicSensor.begin();
  // ultrasonicSensor.start();

  // Initialize SPIFFS
  if (!SPIFFS.begin(true))
  {
    Serial.println("An Error has occurred while mounting SPIFFS");
    return;
  }

  // delete old config
  WiFi.disconnect(true);
  delay(1000);
  // add wifi events
  WiFi.onEvent(WiFiStationConnected, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_CONNECTED);
  WiFi.onEvent(WiFiGotIP, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_GOT_IP);
  WiFi.onEvent(WiFiStationDisconnected, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
  WiFi.mode(WIFI_STA); // station mode: ESP32 connects to access point
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.println("Connecting to WIFI");
  delay(10000);
  timeClient.begin();

  // Route for root / web page
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
            { request->send(SPIFFS, "/index.html", String(), false, processor); });

  // Route to load style.css file
  server.on("/style.css", HTTP_GET, [](AsyncWebServerRequest *request)
            { request->send(SPIFFS, "/style.css", "text/css"); });
  // Route to load script.js file
  server.on("/script.js", HTTP_GET, [](AsyncWebServerRequest *request)
            { request->send(SPIFFS, "/script.js", "text/javascript"); });

  // Route to set GPIO to HIGH
  server.on("/led2on", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    digitalWrite(LED_PIN, HIGH);    
    request->send(SPIFFS, "/index.html", String(), false, processor); });

  // Route to set GPIO to LOW
  server.on("/led2off", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    digitalWrite(LED_PIN, LOW);    
    request->send(SPIFFS, "/index.html", String(), false, processor); });

  server.on("/override", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    int output, state, time;
    //String debug = "";
    // GET input1 value on <ESP_IP>/override?output=<output>&state=<state&time=<time>
    if (request->hasParam(PARAM_OUTPUT) && request->hasParam(PARAM_STATE) && request->hasParam(PARAM_TIME))
    {
      output = request->getParam(PARAM_OUTPUT)->value().toInt();
      state = request->getParam(PARAM_STATE)->value().toInt();
      time = request->getParam(PARAM_TIME)->value().toInt();
      overridePump(output, state, time);
      //debug = "Set pin " + String(output) + " to " + (state == 1) ? "On " : "Off " + (time > 60) ? "permanently" : "for " + String(time) + " min"; 
    }
    else {
      //debug = "No message sent";
    }
    //Serial.println(debug);
    request->send(200, "text/plain", "OK"); });

