ckcd1hp/First-Test-ESP32/src/main.cpp
  server.on("/auto", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    int output;
    //String debug = "";
    // GET input1 value on <ESP_IP>/auto?output=<output>
    if (request->hasParam(PARAM_OUTPUT))
    {
      output = request->getParam(PARAM_OUTPUT)->value().toInt();
      setPumpAuto(output);
    //  debug = "Set pin " + String(output) + " to auto"; 
    }
    else {
     // debug = "No message sent";
    }
    //Serial.println(debug);
    request->send(200, "text/plain", "OK"); });

  // Handle Web Server Events
  events.onConnect([](AsyncEventSourceClient *client)
                   {
    if(client->lastId()){
      Serial.printf("Client reconnected! Last message ID that it got is: %u\n", client->lastId());
    }
    // send event with message "hello!", id current millis
    // and set reconnect delay to 1 second
    client->send("hello!", NULL, millis(), 10000); });
  server.addHandler(&events);
  AsyncElegantOTA.begin(&server);
  WebSerial.begin(&server);
  server.begin();

  // initial dht reading
  getDhtReadings();
}

void loop()
{
  // check if ultrasonic sensor has distance reading
  if (ultrasonicSensor.isFinished())
  {
    displayWaterLevel(ultrasonicSensor.getRange());
  }
  now = millis();
  // sample current sensors every 50ms
  if (now - adcSamplingMillisCounter >= adcSamplingInterval)
  {
    pump1Samples += analogRead(WATER_PUMP_1_CURRENT);
    pump2Samples += analogRead(WATER_PUMP_2_CURRENT);
    airPumpSamples += analogRead(AIR_PUMP_CURRENT);

    // increase sample counter
    adcSamplingMillisCounter += adcSamplingInterval;
    samplingCounter++;
    // 50 samples = 2.5s
    if (samplingCounter >= 50)
    {
      float avgPump1ADC = pump1Samples / 50;
      float pump1Voltage = (avgPump1ADC * (3.31 / 4095.0)) - 1.52; // 1.55 is voltage reading at 0 current
      float pump1Current = 3 * pump1Voltage / mvPerAmp;            // 3 is the gain of the current sensor
      float avgPump2ADC = pump2Samples / 50;
      float pump2Voltage = avgPump2ADC * 3.3 / 4095.0 - 1.52; // 1.55 is voltage reading at 0 current
      float pump2Current = pump2Voltage * 3 / mvPerAmp;
      float avgAirPumpADC = airPumpSamples / 50;
      float airPumpVoltage = avgAirPumpADC * 3.3 / 4095.0 - 1.52; // 1.55 is voltage reading at 0 current
      float airPumpCurrent = airPumpVoltage * 3 / mvPerAmp;
      pump1Status = (pump1Current > 0.5) ? true : false;
      pump2Status = (pump2Current > 0.5) ? true : false;
      airPumpStatus = (airPumpCurrent > 0.5) ? true : false;
      // WebSerial.println("Pump 2 Voltage: " + String(pump2Voltage));
      // WebSerial.println("Pump 2 Current: " + String(pump2Current));
      // WebSerial.println("Air Pump Voltage: " + String(airPumpVoltage));
      // WebSerial.println("Air Pump Current: " + String(airPumpCurrent));
      samplingCounter = 0;
      pump1Samples = 0.0;
      pump2Samples = 0.0;
      airPumpSamples = 0.0;
    }
  }
  // update pump status on the web every 10 seconds
  pumpStatusMillisCounter = setInterval(updatePumpStatuses, pumpStatusMillisCounter, updatePumpStatusInterval);
  // get dht readings every set interval (default 15 min)
  dhtMillisCounter = setInterval(getDhtReadings, dhtMillisCounter, dhtInterval);
  // get water level every set interval (default 15 min)
  waterLevelMillisCounter = setInterval(checkWaterLevel, waterLevelMillisCounter, waterLevelInterval);

  // check counter if connecting to wifi
  if (!readyToConnectWifi)
  {
    if (now - wifiPrevMillis > WIFI_RETRY_WAIT_TIME)
    {
      readyToConnectWifi = true;
      wifiPrevMillis += WIFI_RETRY_WAIT_TIME;
    }
  }
  else if (readyToConnectWifi and WiFi.status() != WL_CONNECTED)
  {
    // ready to connect
    delay(5000); // will attempt to reconnect before disconnect event even fires
    Serial.println("Reconnecting to WiFi");
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    wifiPrevMillis = now; // reset timer
    readyToConnectWifi = false;
  }

  int currentHour = rtc.getHour(true);
  int currentMin = rtc.getMinute();
  int currentSec = rtc.getSecond();

  // check if minute has changed
  if (currentMin != previousMinute)
  {
    // control pump in auto
    controlPumps(currentHour, currentMin);
    previousMinute = currentMin;
  }
  if (currentSec != previousSecond)
  {
    // check override statuses once a second
    checkOverrideStatuses(currentSec);
    // check pump alarms
    checkPumpAlarms();
    previousSecond = currentSec;
  }
  // Update time using NTP at same time everyday (getHour(true) outputs 0-23)
  if (currentHour == NTP_SYNC_HOUR and currentMin == NTP_SYNC_MINUTE and currentSec == NTP_SYNC_SECOND)
  {
    if (!rtcUpdated)
    {
      updateAndSyncTime();
    }
  }
  else
  {
    rtcUpdated = false;
  }
}

void updateAndSyncTime()
{
  if (timeClient.update())
  {
    // successful update
    Serial.println("Recieved updated time from NTP!");
    // set RTC time
    rtc.setTime(timeClient.getEpochTime());
    lastNTPSync = rtc.getTime("%A, %B %d %Y %I:%M %p");
    // Serial.println("RTC: " + lastNTPSync);
    rtcUpdated = true;
  }
  else
  {
    // unsuccessful update, display current unsynced RTC time
    Serial.println("Unable to connect to NTP or already updated within the last 30 minutes");
    Serial.println("RTC: " + rtc.getTime("%A, %B %d %Y %I:%M %p"));
  }
}
String processor(const String &var)
{
  if (var == "GPIO_STATE")
  {
    if (digitalRead(LED_PIN))
    {
      ledState = "ON";
    }
    else
    {
      ledState = "OFF";
    }
    return ledState;
  }
  else if (var == "CURRENT_TIME")
  {
    return rtc.getTime("%A, %B %d %Y %I:%M %p");
  }
  else if (var == "LAST_SYNC_TIME")
  {
    return lastNTPSync;
  }
  else if (var == "TEMPERATURE")
  {
    // get current dht readings to update webpage
    // only needs to run once and temperature is read first
    getDhtReadings();
    return String(f, 1);
  }
  else if (var == "HUMIDITY")
  {
    return String(h, 0);
  }
  else if (var == "HEAT_INDEX")
  {
    return String(hif, 1);
  }
  else if (var == "WATER_LEVEL")
  {
    return ("Checking...");
  }
  else if (var == "PUMP_1_COMMAND")
  {
    String command = "";
    if (digitalRead(WATER_PUMP_1_PIN))
    {
      command = "On ";
    }
    else
    {
      command = "Off ";
    }
    if (pump1Override)
    {
      String timeLeft = "Permanent)";
      if (pump1OverrideTimeEpochEnd > 0)
      {
        timeLeft = String((pump1OverrideTimeEpochEnd - rtc.getEpoch()) / 60) + " min)"; // time left in minutes
      }
      return command + "(Override " + timeLeft;
    }
    return command + "(Auto)";
  }
  else if (var == "PUMP_2_COMMAND")
  {
    String command = "";
    if (digitalRead(WATER_PUMP_2_PIN))
    {
      command = "On ";
    }
    else
    {
      command = "Off ";
    }
    if (pump2Override)
    {
      String timeLeft = "Permanent)";
      if (pump2OverrideTimeEpochEnd > 0)
      {
        timeLeft = String((pump2OverrideTimeEpochEnd - rtc.getEpoch()) / 60) + " min)"; // time left in minutes
      }
      return command + "(Override " + timeLeft;
    }
    return command + "(Auto)";
  }
  else if (var == "AIR_PUMP_COMMAND")
  {
    String command = "";
    if (digitalRead(AIR_PUMP_PIN))
    {
      command = "On ";
    }
    else
    {
      command = "Off ";
    }
    if (airPumpOverride)
    {
      String timeLeft = "Permanent)";
      if (airPumpOverrideTimeEpochEnd > 0)
      {
        timeLeft = String((airPumpOverrideTimeEpochEnd - rtc.getEpoch()) / 60) + " min)"; // time left in minutes
      }
      return command + "(Override " + timeLeft;
    }
    return command + "(Auto)";
  }
  return String();
}
void WiFiStationConnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  Serial.println("Connected to AP successfully!");
}

void WiFiGotIP(WiFiEvent_t event, WiFiEventInfo_t info)
{
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
  // mdns responder for esp32.local
  if (MDNS.begin("esp32"))
  {
    Serial.println("MDNS responder started, accessible via esp32.local");
  }
  delay(2000);
  // The function timeClient.update() syncs the local time to the NTP server. In the video I call this in the main loop. However, NTP servers dont like it if
  // they get pinged all the time, so I recommend to only re-sync to the NTP server occasionally. In this example code we only call this function once in the
  // setup() and you will see that in the loop the local time is automatically updated. Of course the ESP/Arduino does not have an infinitely accurate clock,
  // so if the exact time is very important you will need to re-sync once in a while.
  updateAndSyncTime(); // anytime esp32 reconnects to wifi it will attempt to sync time
}

void WiFiStationDisconnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  Serial.println("Disconnected from WiFi access point");
  Serial.print("WiFi lost connection. Reason: ");
  Serial.println(info.wifi_sta_disconnected.reason);
  WiFi.disconnect(true);
}

// for calling a function every interval
unsigned long setInterval(void (*callback)(), unsigned long previousMillis, unsigned long interval)
{
  if (millis() - previousMillis >= interval)
  {
    callback();
    previousMillis += interval;
  }
  return previousMillis;
}
void overridePump(int pump_pin, int state, int time)
{
  if (pump_pin == WATER_PUMP_1_PIN)
  {
    pump1Override = true;
    pump1Command = state ? true : false;
    if (time > 60)
    {
      // permanent override
      pump1OverrideTimeEpochEnd = 0;
    }
    else
    {
      pump1OverrideTimeEpochEnd = rtc.getEpoch() + (time * 60); // time in minutes to seconds
    }
  }
  else if (pump_pin == WATER_PUMP_2_PIN)
  {
    pump2Override = true;
    pump2Command = state ? true : false;
    if (time > 60)
    {
      // permanent override
      pump2OverrideTimeEpochEnd = 0;
    }
    else
    {
      pump2OverrideTimeEpochEnd = rtc.getEpoch() + (time * 60); // time in minutes to seconds
    }
  }
  else
  {
    airPumpOverride = true;
    airPumpCommand = state ? true : false;
    if (time > 60)
    {
      // permanent override
      airPumpOverrideTimeEpochEnd = 0;
    }
    else
    {
      airPumpOverrideTimeEpochEnd = rtc.getEpoch() + (time * 60); // time in minutes to seconds
    }
  }
  digitalWrite(pump_pin, state);
}
void setPumpAuto(int pump_pin)
{
  int currentHour = rtc.getHour(true); // current time
  if (pump_pin == WATER_PUMP_1_PIN)
  {
    if (currentHour >= 6 and currentHour < 12)
    {
      pump1Command = true;
      digitalWrite(WATER_PUMP_1_PIN, HIGH);
    }
    else
    {
      pump1Command = false;
      digitalWrite(WATER_PUMP_1_PIN, LOW);
    }

    pump1Override = false;
    pump1OverrideTimeEpochEnd = 0;
    // Send Events to the Web Client with the Sensor Readings
    String command = (pump1Command) ? " On " : " Off ";
    String pumpCommand = command + "(Auto)";
    events.send(pumpCommand.c_str(), "pump1Command", millis());
  }
  else if (pump_pin == WATER_PUMP_2_PIN)
  {
    if (currentHour >= 12 and currentHour < 18)
    {
      pump2Command = true;
      digitalWrite(WATER_PUMP_2_PIN, HIGH);
    }
    else
    {
      pump2Command = false;
      digitalWrite(WATER_PUMP_2_PIN, LOW);
    }
    pump2Override = false;
    pump2OverrideTimeEpochEnd = 0;
    // Send Events to the Web Client with the Sensor Readings
    String command = (pump2Command) ? " On " : " Off ";
    String pumpCommand = command + "(Auto)";
    events.send(pumpCommand.c_str(), "pump2Command", millis());
  }
  else
  {
    airPumpCommand = true;
    digitalWrite(AIR_PUMP_PIN, HIGH); // switching back to auto will just turn it on, it'll go back to 15 min on/off
    airPumpOverride = false;
    airPumpOverrideTimeEpochEnd = 0;
    // Send Events to the Web Client with the Sensor Readings
    String pumpCommand = "On (Auto)";
    events.send(pumpCommand.c_str(), "airPumpCommand", millis());
  }
}
void controlPumps(int currentHour, int currentMin)
{
  // function runs once a minute
  // water pump 1
  if (!pump1Override)
  {
    // Run water pump 1 from 6am to 12pm continuously.  The other 12 hours, the pump will run for 1 min on the hour
    if (currentHour >= 6 and currentHour < 12)
      pump1Command = true;
    else if (currentMin == 0)
      pump1Command = true;
    else
      pump1Command = false;
  }
  // water pump 2
  if (!pump2Override)
  { // auto mode
    // Run water pump 2 from 12pm to 6pm continuously.  The other 12 hours, the pump will run for 1 min on the half hour
    if (currentHour >= 12 and currentHour < 18)
      pump2Command = true;
    else if (currentMin == 30)
      pump2Command = true;
    else
      pump2Command = false;
  }
  // air pump
  if (!airPumpOverride)
  { // auto mode
    // Toggle air pump every 15 minutes
    if (currentMin % 15 == 0)
    {
      airPumpCommand = !airPumpCommand;
      // Send Events to the Web Client with Air Pump Command
      String command = (airPumpCommand) ? " On " : " Off ";
      String pumpCommand = command + "(Auto)";
      events.send(pumpCommand.c_str(), "airPumpCommand", millis());
    }
  }
  // set pump1 command
  digitalWrite(WATER_PUMP_1_PIN, pump1Command ? HIGH : LOW);
  // set pump2 command
  digitalWrite(WATER_PUMP_2_PIN, pump2Command ? HIGH : LOW);
  // set air pump command
  digitalWrite(AIR_PUMP_PIN, airPumpCommand ? HIGH : LOW);
}
// check override statuses every second
void checkOverrideStatuses(int currentSecond)
{
  unsigned long epoch = rtc.getEpoch();
  if (pump1Override)
  {
    // pump1 is in override for set duration (set by user from webpage)
    // update web page every minute
    if (currentSecond == 0)
    {
      // if it is 0 it is in permanent override
      if (pump1OverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (pump1Command) ? "On " : "Off ";
        unsigned long timeLeftMin = (pump1OverrideTimeEpochEnd - epoch) / 60;
        String timeLeft = command + "(Override " + String(timeLeftMin) + " min)";
        if (timeLeftMin != 0) // avoid sending 0 min left
          events.send(timeLeft.c_str(), "pump1Command", millis());
      }
    }
    // if epoch has passed the end time, set pump to auto
    if (epoch >= pump1OverrideTimeEpochEnd and pump1OverrideTimeEpochEnd != 0)
    {
      setPumpAuto(WATER_PUMP_1_PIN);
    }
  }
  if (pump2Override)
  {
    // pump2 is in override for set duration (set by user from webpage)
    // update web page every minute
    if (currentSecond == 0)
    {
      if (pump2OverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (pump2Command) ? "On " : "Off ";
        unsigned long timeLeftMin = (pump2OverrideTimeEpochEnd - epoch) / 60;
        String timeLeft = command + "(Override " + String(timeLeftMin) + " min)";
        if (timeLeftMin != 0) // avoid sending 0 min left
          events.send(timeLeft.c_str(), "pump2Command", millis());
      }
    }
    // if pump2OverrideTimeEpochEnd is 0 and pump is in override, then override is permanent
    if (epoch >= pump2OverrideTimeEpochEnd and pump2OverrideTimeEpochEnd != 0)
    {
      setPumpAuto(WATER_PUMP_2_PIN);
    }
  }
  if (airPumpOverride)
  {
    // air pump is in override for set duration (set by user from webpage)
    // update web page every minute
    if (currentSecond == 0)
    {
      if (airPumpOverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (airPumpCommand) ? "On " : "Off ";
        unsigned long timeLeftMin = (airPumpOverrideTimeEpochEnd - epoch) / 60;
        String timeLeft = command + "(Override " + String(timeLeftMin) + " min)";
        if (timeLeftMin != 0) // avoid sending 0 min left
          events.send(timeLeft.c_str(), "airPumpCommand", millis());
      }
    }
    // if pump2OverrideTimeEpochEnd is 0 and pump is in override, then override is permanent
    if (epoch >= airPumpOverrideTimeEpochEnd and airPumpOverrideTimeEpochEnd != 0)
    {
      setPumpAuto(AIR_PUMP_PIN);
    }
  }
}
void updatePumpStatuses()
{
  // Send Events to the Web Client with the pump statuses (every 10 seconds)
  String p1String = (pump1Status) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  String p2String = (pump2Status) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  String airPString = (airPumpStatus) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  events.send(p1String.c_str(), "pump1Status", millis());
  events.send(p2String.c_str(), "pump2Status", millis());
  events.send(airPString.c_str(), "airPumpStatus", millis());
}
void checkPumpAlarms()
{
  if (pump1Command != pump1Status)
  {
    if (pump1AlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!pump1Alarm)
      {
        pump1AlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        Serial.println("Starting pump1 alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= pump1AlarmTimeEpochEnd)
      {
        // set alarm
        pump1Alarm = true;
        pump1AlarmTimeEpochEnd = 0;
        String p1Alarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Water Pump 1";
        events.send(p1Alarm.c_str(), "waterPump1Header", millis());
        Serial.println("Pump1 alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    pump1AlarmTimeEpochEnd = 0;
    if (pump1Alarm)
    {
      pump1Alarm = false;
      String p1 = "Water Pump 1";
      events.send(p1.c_str(), "waterPump1Header", millis());
      Serial.println("Pump1 alarm cleared");
    }
  }
  // check pump2
  if (pump2Command != pump2Status)
  {
    if (pump2AlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!pump2Alarm)
      {
        pump2AlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        Serial.println("Starting pump2 alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= pump2AlarmTimeEpochEnd)
      {
        // set alarm
        pump2Alarm = true;
        pump2AlarmTimeEpochEnd = 0;
        String p2Alarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Water Pump 2";
        events.send(p2Alarm.c_str(), "waterPump2Header", millis());
        Serial.println("Pump2 alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    pump2AlarmTimeEpochEnd = 0;
    if (pump2Alarm)
    {
      pump2Alarm = false;
      String p2 = "Water Pump 2";
      events.send(p2.c_str(), "waterPump2Header", millis());
      Serial.println("Pump2 alarm cleared");
    }
  }
  // check air pump
  if (airPumpCommand != airPumpStatus)
  {
    if (airPumpAlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!airPumpAlarm)
      {
        airPumpAlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        Serial.println("Starting air pump alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= airPumpAlarmTimeEpochEnd)
      {
        // set alarm
        airPumpAlarm = true;
        airPumpAlarmTimeEpochEnd = 0;
        String airPumpAlarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Air Pump";
        events.send(airPumpAlarm.c_str(), "airPumpHeader", millis());
        Serial.println("Air pump alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    airPumpAlarmTimeEpochEnd = 0;
    if (airPumpAlarm)
    {
      airPumpAlarm = false;
      String p = "Air Pump";
      events.send(p.c_str(), "airPumpHeader", millis());
      Serial.println("Air Pump alarm cleared");
    }
  }
}
